In [13]:
import pandas as pd
import numpy as np

In [14]:
import os 

dataframes=[]

for i in os.listdir("datasets"):
    if i.endswith(".csv"):
        dataframes.append(pd.read_csv("datasets/"+i))
len(dataframes)

6

In [15]:
dataframes[0].head()

,State,No. of Habitations Selected for the Study,Utilised Tested and Quality Materials,Not utilised Tested and Quality Materials,Quality and Quantity of Materials used by the Contractor - Not up the Standard/lack of Thickness,Quality and Quantity of Materials used by the Contractor - Used Inadequate Quantity of Black Tapping,Quality and Quantity of Materials used by the Contractor - Used substandard Quality Cement/ Bricks instead of Stones
0,Assam,20,12.0,4.0,4.0,2.0,0.0
1,Bihar,18,10.0,8.0,7.0,0.0,1.0
2,Gujarat,20,12.0,5.0,2.0,0.0,1.0
3,Himachal Pradesh,20,19.0,1.0,0.0,0.0,0.0
4,Kerala,20,18.0,0.0,0.0,0.0,0.0

In [16]:
dataframes[1].head()

,Particulars,03-2008,03-2009,03-2010,03-2011,03-2012,03-2013
0,Total,16026.0,16183.0,NaN,16337.0,16443.0,16537.0
1,Andaman and Nicobar Islands,16.0,16.0,NaN,16.0,16.0,16.0
2,Andhra Pradesh,2118.0,2124.0,NaN,2119.0,2126.0,2132.0
3,Arunachal Pradesh,9.0,9.0,NaN,9.0,9.0,9.0
4,Assam,185.0,189.0,NaN,190.0,190.0,189.0

In [17]:
dataframes[2].head()

,Particulars,03-2008,03-2009,03-2011,03-2012,03-2013
0,Total,13718172.0,13826198.0,14300420.0,14736146.0,15090378.0
1,Andaman and Nicobar Islands,534.0,534.0,534.0,534.0,534.0
2,Andhra Pradesh,2446387.0,2443336.0,2449772.0,2449772.0,2467916.0
3,Arunachal Pradesh,1822.0,1822.0,1822.0,1822.0,1822.0
4,Assam,57130.0,57163.0,56298.0,56249.0,56249.0

In [18]:
dataframes[3].head()

,State,Habitations with 1000+ Population - Habitations Covered (No.s) - Target,Habitations with 1000+ Population - Habitations Covered (No.s) - Achievement,Habitations with 1000+ Population - Length (KM) - Target,Habitations with 1000+ Population - Length (KM) - Achievement,Habitations with 500+ Population - Habitations Covered (No.) - Target,Habitations with 500+ Population - Habitations Covered (No.) - Achievement,Habitations with 500+ Population - Length (KM) - Target,Habitations with 500+ Population - Length (KM) - Achievement
0,Assam,1571.0,822.0,4909.25,1675.00,893.0,197.0,NaN,NaN
1,Bihar,133.0,25.0,340.12,102.30,24.0,5.0,30.00,6.50
2,Gujarat,NaN,9.0,NaN,NaN,NaN,572.0,NaN,852.79
3,Himachal Pradesh,944.0,899.0,3925.72,5024.00,NaN,NaN,NaN,NaN
4,Kerala,6.0,31.0,13.60,49.25,55.0,57.0,95.97,79.57

In [19]:
dataframes[4].head()

,State,No. of Inspections conducted by State Level Monitors (SQM) Independent of executive Agency deployed under Bharat Nirman Programme as reported by: State Level Authorities: 2005-06,State Level Authorities: 2006-07,Quality Observed in Both Years by State Level Monitors: Good,Quality Observed in Both Years by State Level Monitors: Satisfactory,Quality Observed in Both Years by State Level Monitors: Work is going on as per the Specifications,District Level Authorities: 2005-06,District Level Authorities: 2006-07,Block Level Authorities: 2005-06,Block Level Authorities: 2006-07
0,Assam,551,513,NaN,NaN,1.0,86,2,23,3
1,Bihar,164,189,NaN,1.0,NaN,12,15,0,0
2,Gujarat,345,229,NaN,1.0,NaN,79,45,31,16
3,Himachal Pradesh,249,163,1.0,NaN,NaN,34,36,7,10
4,Kerala,57,42,NaN,1.0,NaN,1,1,0,0

In [20]:
dataframes[5].head()

,Particulars,03-2005,03-2006,03-2007,03-2008,03-2009,03-2010,12-2010,03-2011,06-2011,09-2011,12-2011,03-2012,06-2012,09-2012,12-2012,03-2013,06-2013,09-2013,03-2014
0,Residential Total,1119742.0,192197.0,140970.0,98868.0,114009.0,297907.0,NaN,295732.0,NaN,NaN,NaN,422524.0,NaN,NaN,NaN,439286.0,NaN,NaN,1434102.0
1,Residential: Economically Weaker Section,NaN,NaN,118371.0,80490.0,103226.0,229568.0,NaN,241225.0,NaN,NaN,NaN,406934.0,NaN,NaN,NaN,406333.0,NaN,NaN,1410942.0
2,Residential: Lower Income Group,NaN,NaN,612.0,2772.0,327.0,7.0,NaN,35094.0,NaN,NaN,NaN,272.0,NaN,NaN,NaN,18962.0,NaN,NaN,1020.0
3,Residential: Middle Income Group,NaN,NaN,432.0,892.0,682.0,52662.0,NaN,13712.0,NaN,NaN,NaN,4324.0,NaN,NaN,NaN,3295.0,NaN,NaN,6086.0
4,Residential: Higher Income Group,NaN,NaN,20357.0,13744.0,9072.0,15091.0,NaN,5229.0,NaN,NaN,NaN,10994.0,NaN,NaN,NaN,5772.0,NaN,NaN,15910.0

In [ ]:
data